{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>A\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "batch_input_shape": [null, 16, 32, 1], "output_shape": null, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "activation": "relu", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "nb_filter": 2}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [4, 4], "pool_size": [4, 4], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias": true, "output_dim": 1, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "input_dim": 42, "b_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "trainable": true}}]}