{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>=\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 16, 32, 1], "output_shape": null, "input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "trainable": true, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_1", "nb_row": 3, "init": "glorot_uniform", "activation": "elu", "nb_filter": 2, "W_regularizer": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "b_constraint": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [4, 4], "pool_size": [4, 4], "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "input_dim": 42, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 1, "trainable": true}}]}